
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 1 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES-HOST-V15
* Replace
  * module.postgresql_v15.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.postgresql_v15.azurerm_postgresql_flexible_server_database.pg_databases[&#34;ccd_definition_store&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-HOST-V15 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-HOST-V15" {
        id                      = "https://ccd-aat.vault.azure.net/secrets/definition-store-api-POSTGRES-HOST-V15/e580dc7dac3443aaa49c48ec7199cd9e"
        name                    = "definition-store-api-POSTGRES-HOST-V15"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.postgresql_v15.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgres-expanded" -> "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql" # forces replacement
      ~ fqdn                          = "ccd-definition-store-api-postgres-db-v15-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-definition-store-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-definition-store-api-postgres-db-v15-aat" -> (known after apply)
        name                          = "ccd-definition-store-api-postgres-db-v15-aat"
      ~ public_network_access_enabled = false -> (known after apply)
      - replication_role              = "" -> null
        tags                          = {
            "application"         = "core-case-data"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/ccd-definition-store-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ccd-community"
            "environment"         = "staging"
            "managedBy"           = "CCD"
        }
      - zone                          = "3" -> null
        # (12 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "1" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-definition-store-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-definition-store-api-postgres-db-v15-aat/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-definition-store-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-definition-store-api-postgres-db-v15-aat" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_v15.azurerm_postgresql_flexible_server_database.pg_databases["ccd_definition_store"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-definition-store-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-definition-store-api-postgres-db-v15-aat/databases/ccd_definition_store" -> (known after apply)
        name      = "ccd_definition_store"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-definition-store-api-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-definition-store-api-postgres-db-v15-aat" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1415,"Program":"tfcmt","SHA1":"","Vars":{}} -->